tap "browsh-org/browsh"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "thezoraiz/ascii-image-converter"
tap "xcodesorg/made"
brew "bash"
brew "bat"
brew "boost"
brew "btop"
brew "ccls"
brew "clipboard"
brew "cmake"
brew "php"
brew "composer"
brew "doxygen"
brew "eza"
brew "opus"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "gpatch"
brew "graphviz"
brew "node"
brew "gtop"
brew "julia"
brew "lazygit"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "miniupnpc"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "neovim-remote"
brew "pkg-config"
brew "python@3.11"
brew "rich-cli"
brew "ripgrep"
brew "sox"
brew "starship"
brew "stylua"
brew "sunshine"
brew "tealdeer"
brew "tree"
brew "wget"
brew "xclip"
brew "xsel"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "browsh-org/browsh/browsh"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "xcodesorg/made/xcodes"
cask "font-hack-nerd-font"
vscode "astro-build.astro-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "felixangelov.bloc"
vscode "fenkinet.swiftui"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "harryhopkinson.vim-theme"
vscode "hipstersmoothie-public.github-dark-high-contrast"
vscode "loyio.nand2tetris-vscode"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mechatroner.rainbow-csv"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pabitrabanerjee.idx-dark-theme"
vscode "parallelsdesktop.parallels-desktop"
vscode "pdconsec.vscode-print"
vscode "peterj.proto"
vscode "pythagoratechnologies.gpt-pilot-vs-code"
vscode "qwtel.sqlite-viewer"
vscode "rdebugger.r-debugger"
vscode "redhat.java"
vscode "rickaym.manim-sideview"
vscode "ritwickdey.liveserver"
vscode "rjyoung.vscode-modern-vhdl-support"
vscode "rust-lang.rust-analyzer"
vscode "selemondev.vscode-shadcn-svelte"
vscode "sswg.swift-lang"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "telmen.xcode-theme"
vscode "tushortz.java-snippets"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wpilibsuite.vscode-wpilib"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
